espressif/esp-idf/components/soc/esp32c5/register/soc/interrupt_matrix_reg.h
/** INTERRUPT_CORE0_ZB_MAC_INTR_MAP_REG register
 *  ZB_MAC_INTR mapping register
 */
#define INTERRUPT_CORE0_ZB_MAC_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x30)
/** INTERRUPT_CORE0_ZB_MAC_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_ZB_MAC_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_ZB_MAC_INTR_MAP_M  (INTERRUPT_CORE0_ZB_MAC_INTR_MAP_V << INTERRUPT_CORE0_ZB_MAC_INTR_MAP_S)
#define INTERRUPT_CORE0_ZB_MAC_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_ZB_MAC_INTR_MAP_S  0

/** INTERRUPT_CORE0_PMU_INTR_MAP_REG register
 *  PMU_INTR mapping register
 */
#define INTERRUPT_CORE0_PMU_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x34)
/** INTERRUPT_CORE0_PMU_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_PMU_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_PMU_INTR_MAP_M  (INTERRUPT_CORE0_PMU_INTR_MAP_V << INTERRUPT_CORE0_PMU_INTR_MAP_S)
#define INTERRUPT_CORE0_PMU_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_PMU_INTR_MAP_S  0

/** INTERRUPT_CORE0_EFUSE_INTR_MAP_REG register
 *  EFUSE_INTR mapping register
 */
#define INTERRUPT_CORE0_EFUSE_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x38)
/** INTERRUPT_CORE0_EFUSE_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_EFUSE_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_EFUSE_INTR_MAP_M  (INTERRUPT_CORE0_EFUSE_INTR_MAP_V << INTERRUPT_CORE0_EFUSE_INTR_MAP_S)
#define INTERRUPT_CORE0_EFUSE_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_EFUSE_INTR_MAP_S  0

/** INTERRUPT_CORE0_LP_RTC_TIMER_INTR_MAP_REG register
 *  LP_RTC_TIMER_INTR mapping register
 */
#define INTERRUPT_CORE0_LP_RTC_TIMER_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x3c)
/** INTERRUPT_CORE0_LP_RTC_TIMER_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_LP_RTC_TIMER_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_LP_RTC_TIMER_INTR_MAP_M  (INTERRUPT_CORE0_LP_RTC_TIMER_INTR_MAP_V << INTERRUPT_CORE0_LP_RTC_TIMER_INTR_MAP_S)
#define INTERRUPT_CORE0_LP_RTC_TIMER_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_LP_RTC_TIMER_INTR_MAP_S  0

/** INTERRUPT_CORE0_LP_UART_INTR_MAP_REG register
 *  LP_UART_INTR mapping register
 */
#define INTERRUPT_CORE0_LP_UART_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x40)
/** INTERRUPT_CORE0_LP_UART_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_LP_UART_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_LP_UART_INTR_MAP_M  (INTERRUPT_CORE0_LP_UART_INTR_MAP_V << INTERRUPT_CORE0_LP_UART_INTR_MAP_S)
#define INTERRUPT_CORE0_LP_UART_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_LP_UART_INTR_MAP_S  0

/** INTERRUPT_CORE0_LP_I2C_INTR_MAP_REG register
 *  LP_I2C_INTR mapping register
 */
#define INTERRUPT_CORE0_LP_I2C_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x44)
/** INTERRUPT_CORE0_LP_I2C_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_LP_I2C_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_LP_I2C_INTR_MAP_M  (INTERRUPT_CORE0_LP_I2C_INTR_MAP_V << INTERRUPT_CORE0_LP_I2C_INTR_MAP_S)
#define INTERRUPT_CORE0_LP_I2C_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_LP_I2C_INTR_MAP_S  0

/** INTERRUPT_CORE0_LP_WDT_INTR_MAP_REG register
 *  LP_WDT_INTR mapping register
 */
#define INTERRUPT_CORE0_LP_WDT_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x48)
/** INTERRUPT_CORE0_LP_WDT_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_LP_WDT_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_LP_WDT_INTR_MAP_M  (INTERRUPT_CORE0_LP_WDT_INTR_MAP_V << INTERRUPT_CORE0_LP_WDT_INTR_MAP_S)
#define INTERRUPT_CORE0_LP_WDT_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_LP_WDT_INTR_MAP_S  0

/** INTERRUPT_CORE0_LP_PERI_TIMEOUT_INTR_MAP_REG register
 *  LP_PERI_TIMEOUT_INTR mapping register
 */
#define INTERRUPT_CORE0_LP_PERI_TIMEOUT_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x4c)
/** INTERRUPT_CORE0_LP_PERI_TIMEOUT_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_LP_PERI_TIMEOUT_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_LP_PERI_TIMEOUT_INTR_MAP_M  (INTERRUPT_CORE0_LP_PERI_TIMEOUT_INTR_MAP_V << INTERRUPT_CORE0_LP_PERI_TIMEOUT_INTR_MAP_S)
#define INTERRUPT_CORE0_LP_PERI_TIMEOUT_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_LP_PERI_TIMEOUT_INTR_MAP_S  0

/** INTERRUPT_CORE0_LP_APM_M0_INTR_MAP_REG register
 *  LP_APM_M0_INTR mapping register
 */
#define INTERRUPT_CORE0_LP_APM_M0_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x50)
/** INTERRUPT_CORE0_LP_APM_M0_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_LP_APM_M0_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_LP_APM_M0_INTR_MAP_M  (INTERRUPT_CORE0_LP_APM_M0_INTR_MAP_V << INTERRUPT_CORE0_LP_APM_M0_INTR_MAP_S)
#define INTERRUPT_CORE0_LP_APM_M0_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_LP_APM_M0_INTR_MAP_S  0

/** INTERRUPT_CORE0_LP_APM_M1_INTR_MAP_REG register
 *  LP_APM_M1_INTR mapping register
 */
#define INTERRUPT_CORE0_LP_APM_M1_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x54)
/** INTERRUPT_CORE0_LP_APM_M1_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_LP_APM_M1_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_LP_APM_M1_INTR_MAP_M  (INTERRUPT_CORE0_LP_APM_M1_INTR_MAP_V << INTERRUPT_CORE0_LP_APM_M1_INTR_MAP_S)
#define INTERRUPT_CORE0_LP_APM_M1_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_LP_APM_M1_INTR_MAP_S  0

/** INTERRUPT_CORE0_HUK_INTR_MAP_REG register
 *  HUK_INTR mapping register
 */
#define INTERRUPT_CORE0_HUK_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x58)
/** INTERRUPT_CORE0_HUK_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_HUK_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_HUK_INTR_MAP_M  (INTERRUPT_CORE0_HUK_INTR_MAP_V << INTERRUPT_CORE0_HUK_INTR_MAP_S)
#define INTERRUPT_CORE0_HUK_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_HUK_INTR_MAP_S  0

