espressif/esp-idf/components/soc/esp32c5/register/soc/interrupt_matrix_reg.h
/** INTERRUPT_CORE0_PWM_INTR_MAP_REG register
 *  PWM_INTR mapping register
 */
#define INTERRUPT_CORE0_PWM_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0xfc)
/** INTERRUPT_CORE0_PWM_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_PWM_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_PWM_INTR_MAP_M  (INTERRUPT_CORE0_PWM_INTR_MAP_V << INTERRUPT_CORE0_PWM_INTR_MAP_S)
#define INTERRUPT_CORE0_PWM_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_PWM_INTR_MAP_S  0

/** INTERRUPT_CORE0_PCNT_INTR_MAP_REG register
 *  PCNT_INTR mapping register
 */
#define INTERRUPT_CORE0_PCNT_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x100)
/** INTERRUPT_CORE0_PCNT_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_PCNT_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_PCNT_INTR_MAP_M  (INTERRUPT_CORE0_PCNT_INTR_MAP_V << INTERRUPT_CORE0_PCNT_INTR_MAP_S)
#define INTERRUPT_CORE0_PCNT_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_PCNT_INTR_MAP_S  0

/** INTERRUPT_CORE0_PARL_IO_TX_INTR_MAP_REG register
 *  PARL_IO_TX_INTR mapping register
 */
#define INTERRUPT_CORE0_PARL_IO_TX_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x104)
/** INTERRUPT_CORE0_PARL_IO_TX_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_PARL_IO_TX_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_PARL_IO_TX_INTR_MAP_M  (INTERRUPT_CORE0_PARL_IO_TX_INTR_MAP_V << INTERRUPT_CORE0_PARL_IO_TX_INTR_MAP_S)
#define INTERRUPT_CORE0_PARL_IO_TX_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_PARL_IO_TX_INTR_MAP_S  0

/** INTERRUPT_CORE0_PARL_IO_RX_INTR_MAP_REG register
 *  PARL_IO_RX_INTR mapping register
 */
#define INTERRUPT_CORE0_PARL_IO_RX_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x108)
/** INTERRUPT_CORE0_PARL_IO_RX_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_PARL_IO_RX_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_PARL_IO_RX_INTR_MAP_M  (INTERRUPT_CORE0_PARL_IO_RX_INTR_MAP_V << INTERRUPT_CORE0_PARL_IO_RX_INTR_MAP_S)
#define INTERRUPT_CORE0_PARL_IO_RX_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_PARL_IO_RX_INTR_MAP_S  0

/** INTERRUPT_CORE0_DMA_IN_CH0_INTR_MAP_REG register
 *  DMA_IN_CH0_INTR mapping register
 */
#define INTERRUPT_CORE0_DMA_IN_CH0_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x10c)
/** INTERRUPT_CORE0_DMA_IN_CH0_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_DMA_IN_CH0_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_DMA_IN_CH0_INTR_MAP_M  (INTERRUPT_CORE0_DMA_IN_CH0_INTR_MAP_V << INTERRUPT_CORE0_DMA_IN_CH0_INTR_MAP_S)
#define INTERRUPT_CORE0_DMA_IN_CH0_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_DMA_IN_CH0_INTR_MAP_S  0

/** INTERRUPT_CORE0_DMA_IN_CH1_INTR_MAP_REG register
 *  DMA_IN_CH1_INTR mapping register
 */
#define INTERRUPT_CORE0_DMA_IN_CH1_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x110)
/** INTERRUPT_CORE0_DMA_IN_CH1_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_DMA_IN_CH1_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_DMA_IN_CH1_INTR_MAP_M  (INTERRUPT_CORE0_DMA_IN_CH1_INTR_MAP_V << INTERRUPT_CORE0_DMA_IN_CH1_INTR_MAP_S)
#define INTERRUPT_CORE0_DMA_IN_CH1_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_DMA_IN_CH1_INTR_MAP_S  0

/** INTERRUPT_CORE0_DMA_IN_CH2_INTR_MAP_REG register
 *  DMA_IN_CH2_INTR mapping register
 */
#define INTERRUPT_CORE0_DMA_IN_CH2_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x114)
/** INTERRUPT_CORE0_DMA_IN_CH2_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_DMA_IN_CH2_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_DMA_IN_CH2_INTR_MAP_M  (INTERRUPT_CORE0_DMA_IN_CH2_INTR_MAP_V << INTERRUPT_CORE0_DMA_IN_CH2_INTR_MAP_S)
#define INTERRUPT_CORE0_DMA_IN_CH2_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_DMA_IN_CH2_INTR_MAP_S  0

/** INTERRUPT_CORE0_DMA_OUT_CH0_INTR_MAP_REG register
 *  DMA_OUT_CH0_INTR mapping register
 */
#define INTERRUPT_CORE0_DMA_OUT_CH0_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x118)
/** INTERRUPT_CORE0_DMA_OUT_CH0_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_DMA_OUT_CH0_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_DMA_OUT_CH0_INTR_MAP_M  (INTERRUPT_CORE0_DMA_OUT_CH0_INTR_MAP_V << INTERRUPT_CORE0_DMA_OUT_CH0_INTR_MAP_S)
#define INTERRUPT_CORE0_DMA_OUT_CH0_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_DMA_OUT_CH0_INTR_MAP_S  0

/** INTERRUPT_CORE0_DMA_OUT_CH1_INTR_MAP_REG register
 *  DMA_OUT_CH1_INTR mapping register
 */
#define INTERRUPT_CORE0_DMA_OUT_CH1_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x11c)
/** INTERRUPT_CORE0_DMA_OUT_CH1_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_DMA_OUT_CH1_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_DMA_OUT_CH1_INTR_MAP_M  (INTERRUPT_CORE0_DMA_OUT_CH1_INTR_MAP_V << INTERRUPT_CORE0_DMA_OUT_CH1_INTR_MAP_S)
#define INTERRUPT_CORE0_DMA_OUT_CH1_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_DMA_OUT_CH1_INTR_MAP_S  0

/** INTERRUPT_CORE0_DMA_OUT_CH2_INTR_MAP_REG register
 *  DMA_OUT_CH2_INTR mapping register
 */
#define INTERRUPT_CORE0_DMA_OUT_CH2_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x120)
/** INTERRUPT_CORE0_DMA_OUT_CH2_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_DMA_OUT_CH2_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_DMA_OUT_CH2_INTR_MAP_M  (INTERRUPT_CORE0_DMA_OUT_CH2_INTR_MAP_V << INTERRUPT_CORE0_DMA_OUT_CH2_INTR_MAP_S)
#define INTERRUPT_CORE0_DMA_OUT_CH2_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_DMA_OUT_CH2_INTR_MAP_S  0

/** INTERRUPT_CORE0_GPSPI2_INTR_MAP_REG register
 *  GPSPI2_INTR mapping register
 */
#define INTERRUPT_CORE0_GPSPI2_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x124)
/** INTERRUPT_CORE0_GPSPI2_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_GPSPI2_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_GPSPI2_INTR_MAP_M  (INTERRUPT_CORE0_GPSPI2_INTR_MAP_V << INTERRUPT_CORE0_GPSPI2_INTR_MAP_S)
#define INTERRUPT_CORE0_GPSPI2_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_GPSPI2_INTR_MAP_S  0

/** INTERRUPT_CORE0_AES_INTR_MAP_REG register
 *  AES_INTR mapping register
 */
#define INTERRUPT_CORE0_AES_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x128)
/** INTERRUPT_CORE0_AES_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_AES_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_AES_INTR_MAP_M  (INTERRUPT_CORE0_AES_INTR_MAP_V << INTERRUPT_CORE0_AES_INTR_MAP_S)
#define INTERRUPT_CORE0_AES_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_AES_INTR_MAP_S  0

/** INTERRUPT_CORE0_SHA_INTR_MAP_REG register
 *  SHA_INTR mapping register
 */
#define INTERRUPT_CORE0_SHA_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x12c)
/** INTERRUPT_CORE0_SHA_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_SHA_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_SHA_INTR_MAP_M  (INTERRUPT_CORE0_SHA_INTR_MAP_V << INTERRUPT_CORE0_SHA_INTR_MAP_S)
#define INTERRUPT_CORE0_SHA_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_SHA_INTR_MAP_S  0

/** INTERRUPT_CORE0_RSA_INTR_MAP_REG register
 *  RSA_INTR mapping register
 */
#define INTERRUPT_CORE0_RSA_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x130)
/** INTERRUPT_CORE0_RSA_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_RSA_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_RSA_INTR_MAP_M  (INTERRUPT_CORE0_RSA_INTR_MAP_V << INTERRUPT_CORE0_RSA_INTR_MAP_S)
#define INTERRUPT_CORE0_RSA_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_RSA_INTR_MAP_S  0

/** INTERRUPT_CORE0_ECC_INTR_MAP_REG register
 *  ECC_INTR mapping register
 */
#define INTERRUPT_CORE0_ECC_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x134)
/** INTERRUPT_CORE0_ECC_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_ECC_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_ECC_INTR_MAP_M  (INTERRUPT_CORE0_ECC_INTR_MAP_V << INTERRUPT_CORE0_ECC_INTR_MAP_S)
#define INTERRUPT_CORE0_ECC_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_ECC_INTR_MAP_S  0

