espressif/esp-idf/components/soc/esp32c5/register/soc/interrupt_matrix_reg.h
/** INTERRUPT_CORE0_ECDSA_INTR_MAP_REG register
 *  ECDSA_INTR mapping register
 */
#define INTERRUPT_CORE0_ECDSA_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x138)
/** INTERRUPT_CORE0_ECDSA_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_ECDSA_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_ECDSA_INTR_MAP_M  (INTERRUPT_CORE0_ECDSA_INTR_MAP_V << INTERRUPT_CORE0_ECDSA_INTR_MAP_S)
#define INTERRUPT_CORE0_ECDSA_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_ECDSA_INTR_MAP_S  0

/** INTERRUPT_CORE0_KM_INTR_MAP_REG register
 *  KM_INTR mapping register
 */
#define INTERRUPT_CORE0_KM_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x13c)
/** INTERRUPT_CORE0_KM_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_KM_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_KM_INTR_MAP_M  (INTERRUPT_CORE0_KM_INTR_MAP_V << INTERRUPT_CORE0_KM_INTR_MAP_S)
#define INTERRUPT_CORE0_KM_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_KM_INTR_MAP_S  0

/** INTERRUPT_CORE0_INT_STATUS_0_REG register
 *  Status register for interrupt sources 0 ~ 31
 */
#define INTERRUPT_CORE0_INT_STATUS_0_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x140)
/** INTERRUPT_CORE0_INT_STATUS_0 : RO; bitpos: [31:0]; default: 0;
 *  Represents the status of the interrupt sources numbered from .Each bit corresponds
 *  to one interrupt source
 *  0:The corresponding interrupt source triggered an interrupt
 *  1:No interrupt triggered
 */
#define INTERRUPT_CORE0_INT_STATUS_0    0xFFFFFFFFU
#define INTERRUPT_CORE0_INT_STATUS_0_M  (INTERRUPT_CORE0_INT_STATUS_0_V << INTERRUPT_CORE0_INT_STATUS_0_S)
#define INTERRUPT_CORE0_INT_STATUS_0_V  0xFFFFFFFFU
#define INTERRUPT_CORE0_INT_STATUS_0_S  0

/** INTERRUPT_CORE0_INT_STATUS_1_REG register
 *  Status register for interrupt sources 32 ~ 63
 */
#define INTERRUPT_CORE0_INT_STATUS_1_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x144)
/** INTERRUPT_CORE0_INT_STATUS_1 : RO; bitpos: [31:0]; default: 0;
 *  Represents the status of the interrupt sources numbered from .Each bit corresponds
 *  to one interrupt source
 *  0:The corresponding interrupt source triggered an interrupt
 *  1:No interrupt triggered
 */
#define INTERRUPT_CORE0_INT_STATUS_1    0xFFFFFFFFU
#define INTERRUPT_CORE0_INT_STATUS_1_M  (INTERRUPT_CORE0_INT_STATUS_1_V << INTERRUPT_CORE0_INT_STATUS_1_S)
#define INTERRUPT_CORE0_INT_STATUS_1_V  0xFFFFFFFFU
#define INTERRUPT_CORE0_INT_STATUS_1_S  0

/** INTERRUPT_CORE0_INT_STATUS_2_REG register
 *  Status register for interrupt sources 64 ~ 95
 */
#define INTERRUPT_CORE0_INT_STATUS_2_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x148)
/** INTERRUPT_CORE0_INT_STATUS_2 : RO; bitpos: [31:0]; default: 0;
 *  Represents the status of the interrupt sources numbered from .Each bit corresponds
 *  to one interrupt source
 *  0:The corresponding interrupt source triggered an interrupt
 *  1:No interrupt triggered
 */
#define INTERRUPT_CORE0_INT_STATUS_2    0xFFFFFFFFU
#define INTERRUPT_CORE0_INT_STATUS_2_M  (INTERRUPT_CORE0_INT_STATUS_2_V << INTERRUPT_CORE0_INT_STATUS_2_S)
#define INTERRUPT_CORE0_INT_STATUS_2_V  0xFFFFFFFFU
#define INTERRUPT_CORE0_INT_STATUS_2_S  0

/** INTERRUPT_CORE0_CLOCK_GATE_REG register
 *  Interrupt clock gating configure register
 */
#define INTERRUPT_CORE0_CLOCK_GATE_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x14c)
/** INTERRUPT_CORE0_REG_CLK_EN : R/W; bitpos: [0]; default: 0;
 *  Interrupt clock gating configure register
 */
#define INTERRUPT_CORE0_REG_CLK_EN    (BIT(0))
#define INTERRUPT_CORE0_REG_CLK_EN_M  (INTERRUPT_CORE0_REG_CLK_EN_V << INTERRUPT_CORE0_REG_CLK_EN_S)
#define INTERRUPT_CORE0_REG_CLK_EN_V  0x00000001U
#define INTERRUPT_CORE0_REG_CLK_EN_S  0

/** INTERRUPT_CORE0_INTERRUPT_DATE_REG register
 *  Version control register
 */
#define INTERRUPT_CORE0_INTERRUPT_DATE_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x7fc)
/** INTERRUPT_CORE0_INTERRUPT_DATE : R/W; bitpos: [27:0]; default: 36773985;
 *  Version control register
 */
#define INTERRUPT_CORE0_INTERRUPT_DATE    0x0FFFFFFFU
#define INTERRUPT_CORE0_INTERRUPT_DATE_M  (INTERRUPT_CORE0_INTERRUPT_DATE_V << INTERRUPT_CORE0_INTERRUPT_DATE_S)
#define INTERRUPT_CORE0_INTERRUPT_DATE_V  0x0FFFFFFFU
#define INTERRUPT_CORE0_INTERRUPT_DATE_S  0

#ifdef __cplusplus
}
#endif
